#Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
if len(list) % 2:
     for i in range((len(list) // 2) + 1):
         print(list[i] * list[-i - 1], end=' ')
else:
     for i in range(len(list) // 2):
         print(list[i] * list[-i - 1], end=' ')
