# 4.	Напишите программу, которая проверяет пятизначное число на палиндром.

n = input('Введите пятизначное число: ')

if n[0] == n [-1] and n [1] == n [-2]:
    print('Число являеться палиндромом')
else:
    print('Число не являеться палиндромом')