#2.	Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
#1.	с помощью математических формул нахождения корней квадратного уравнения
#2.	с помощью дополнительных библиотек Python


input('Введите знапчения А В С ')
a, b, c = [int(i) for i in input('Введите знапчения a b c ').split()]
d = b**2 - 4 * a * c
if d  > 0:
    x1 - (-b - match.sqrt(d))/2*a
    x2 - (-b - match.sqrt(d))/2*a
    print(f'Корни уравнения x1 = {x1} x2 = {x2}')
elif d == 0:
    x1 = -d/(2*a)
    print("Корень = ", x1)
else:
    print("Корней нет")